tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Friendly powerful distributed version control system
brew "bazaar"
# Generate compilation database for clang tooling
brew "bear"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# HTTP/2 C Library
brew "nghttp2"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql@5.7"
# Package for scientific computing with Python
brew "numpy"
# Cross-platform application and UI framework
brew "qt@5"
# Open source computer vision library
brew "opencv"
# NREL-supported OpenFAST whole-turbine simulation code
brew "openfast"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# User interface to the TELNET protocol
brew "telnet"
# Compress/expand executable files
brew "upx"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Application launcher and productivity software
cask "alfred"
# Web debugging Proxy application
cask "charles"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Java IDE by JetBrains
cask "intellij-idea"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# Visual user interface for Docker Container management
cask "kitematic"
# Kubernetes desktop client
cask "kubernetic"
# Kubernetes IDE
cask "lens"
# Java heap analyzer
cask "mat"
# Media player based on MPlayer and mplayer2
cask "mpv"
# App to write, plan, collaborate, and get organized
cask "notion"
# Visual communication software
cask "omnigraffle"
# JDK from Oracle
cask "oracle-jdk"
# Tool for uploading images
cask "picgo"
# Collaboration platform for API development
cask "postman"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Next Generation of ShadowsocksX
cask "shadowsocksx-ng-r"
# Graphical client for Git version control
cask "sourcetree"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Configurable document editor that supports Markdown
cask "typora"
# Collection of tools to build a dedicated basic communication network
cask "v2rayu"
# GUI for v2ray-core
cask "v2rayx"
# Open-source code editor
cask "visual-studio-code"
mas "ChmPages", id: 1164062917
mas "com.echodot.Red", id: 1491764008
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Noted", id: 1446580517
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "RDM - GUI for Redis®", id: 1475905948
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "WPS Office", id: 1443749478
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "熊掌记", id: 1091189122
mas "解压专家Oka", id: 1441507725
mas "钉钉", id: 1435447041
