tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Friendly powerful distributed version control system
brew "bazaar"
# Next generation open source RPC library and framework
brew "grpc"
# Generate compilation database for clang tooling
brew "bear"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# GNU compiler collection
brew "gcc@10"
# GNU debugger
brew "gdb"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Configurable static site generator
brew "hugo"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql@5.7"
# HTTP/2 C Library
brew "nghttp2"
# Package for scientific computing with Python
brew "numpy", link: false
# Open source computer vision library
brew "opencv"
# NREL-supported OpenFAST whole-turbine simulation code
brew "openfast"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Program that allows you to count code, quickly
brew "tokei"
# Compress/expand executable files
brew "upx"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Application launcher and productivity software
cask "alfred"
# Web debugging Proxy application
cask "charles"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Java IDE by JetBrains
cask "intellij-idea"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# Visual user interface for Docker Container management
cask "kitematic"
# Kubernetes desktop client
cask "kubernetic"
# Kubernetes IDE
cask "lens"
# Java heap analyzer
cask "mat"
# Media player based on MPlayer and mplayer2
cask "mpv"
# App to write, plan, collaborate, and get organized
cask "notion"
# Visual communication software
cask "omnigraffle"
# JDK from Oracle
cask "oracle-jdk"
# Tool for uploading images
cask "picgo"
# Collaboration platform for API development
cask "postman"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Next Generation of ShadowsocksX
cask "shadowsocksx-ng-r"
# Graphical client for Git version control
cask "sourcetree"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Configurable document editor that supports Markdown
cask "typora"
# Collection of tools to build a dedicated basic communication network
cask "v2rayu"
# GUI for v2ray-core
cask "v2rayx"
# Open-source code editor
cask "visual-studio-code"
mas "ChmPages", id: 1164062917
mas "com.echodot.Red", id: 1491764008
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Noted", id: 1446580517
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "RESP.app - Developer GUI for Redis®", id: 1475905948
mas "Sequel Ace", id: 1518036000
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "熊掌记", id: 1091189122
mas "解压专家Oka", id: 1441507725
mas "钉钉", id: 1435447041
vscode "arcticicestudio.nord-visual-studio-code"
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "infeng.vscode-react-typescript"
vscode "James-Yu.latex-workshop"
vscode "jock.svg"
vscode "MichaelZhou.fleet-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.test-adapter-converter"
vscode "octref.vetur"
vscode "PKief.material-icon-theme"
vscode "PolyMeilex.wgsl"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "rust-lang.rust"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "serayuzgur.crates"
vscode "sleistner.vscode-fileutils"
vscode "Swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
