tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Friendly powerful distributed version control system
brew "bazaar"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Mac App Store command-line interface
brew "mas"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open source relational database management system
brew "mysql@5.7", restart_service: true
# User interface to the TELNET protocol
brew "telnet"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
cask "alfred"
cask "dash"
cask "discord"
cask "docker"
cask "goland"
cask "google-chrome"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "kitematic"
cask "kubernetic"
cask "lens"
cask "mat"
cask "mpv"
cask "notion"
cask "omnigraffle"
cask "oracle-jdk"
cask "picgo"
cask "postman"
cask "sequel-pro"
cask "shadowsocksx-ng-r"
cask "sourcetree"
cask "tunnelblick"
cask "typora"
cask "v2rayu"
cask "v2rayx"
cask "visual-studio-code"
mas "ChmPages", id: 1164062917
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Noted", id: 1446580517
mas "Numbers 表格", id: 409203825
mas "Oka解压专家", id: 1441507725
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "Red", id: 1491764008
mas "Redis Desktop Manager", id: 1475905948
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "熊掌记", id: 1091189122
mas "钉钉", id: 1435447041
